Repository: AKotov-dev/RPMCreator
Catalog: RPMCreator/languages/RPMCreator.*.po
Languages: ru

source: About
ru: О программе

source: Package build program License: GPLv3 Compilation: Lazarus 2.0.10 Author: alex_q_2000 (C) 2021 Grantitudes: AlexL Used by rpmbuild (spec, src) Russian Linux Forum: https://linuxforum.ru
ru: Программа сборки пакетов Лицензия: GPLv3 Компиляция: Lazarus 2.0.10 Автор: alex_q_2000 (C) 2021 Благодарности: AlexL Используется rpmbuild (spec, src) Russian Linux Forum: https://linuxforum.ru

source: |About
ru: |О программе

# tmainform.buildbtn.caption
source: Build package
ru: Собрать пакет

source: building an intermediate archive, wait...
ru: сборка промежуточного архива, ждите...

source: + Files and Folders
ru: + Файлы и Папки

source: |Add files to the list [active Ctrl+Mouse]
ru: |Добавить файлы в список [активно Ctrl+Мышь]

source: |Delete selected list entries
ru: |Удалить выбранные записи

source: |Select all entries in the list
ru: |Выбрать все записи в списке

source: Create repack.txt
ru: Создать repack.txt

source: |The root password will be required; A file will be created /usr/share/doc/package_name/repack.txt and the directory is added to the list of package files
ru: |Потребуется пароль root; будет создан файл /usr/share/doc/package_name/repack.txt и каталог добавлен в список файлов пакета

source: |Additionally build a DEB package in ~/debbuild
ru: |Дополнительно собрать пакет DEB в ~/debbuild

source: |Package names separated by commas or spaces
ru: |Имена пакетов разделяются запятыми или пробелами

source: |Move record down
ru: |Переместить запись вниз

source: Package name:
ru: Имя пакета:

source: URL author sources + binaries (32 bit):
ru: URL авторских sources + binaries (32 bit):

source: Before install (%pre):
ru: Перед установкой (%pre):

source: Before remove (%preun):
ru: Перед удалением (%preun):

source: Vendor:
ru: Вендор:

source: License:
ru: Лицензия:

source: Group:
ru: Группа:

source: Brief description of the package:
ru: Краткое описание пакета:

source: URL of a copy of the source code (*.tar.gz, *.src.rpm, etc):
ru: URL копии исходников (*.tar.gz, *.src.rpm, etc):

source: Development tools:
ru: Инструмент разработки:

source: Program name:
ru: Название программы:

# tmainform.label20.caption
source: Version:
ru: Версия:

source: URL author sources + binaries (64 bit):
ru: URL авторских sources + binaries (64 bit):

source: Additional information:
ru: Дополнительная информация:

source: Package dependencies:
ru: Зависимости пакета:

# tmainform.label4.caption
source: Version:
ru: Версия:

source: Package description:
ru: Описание пакета:

source: After install (%post):
ru: После установки (%post):

source: After remove (%postun):
ru: После удаления (%postun):

source: Release:
ru: Релиз:

source: Maintainer:
ru: Майнтейнер:

source: |List of files and folders to build the package [there is a PopUp menu]
ru: |Список файлов и папок для сборки пакета [есть PopUp меню]

# tmainform.loadbtn.caption
source: Load project
ru: Загрузить проект

source: |Load *.prj or *.lst files
ru: |Загрузить *.prj или *.lst файлы

source: Add objects
ru: Добавить объекты

# tmainform.menuitem10.caption
source: Build package
ru: Собрать пакет

# tmainform.menuitem7.caption
source: Load project
ru: Загрузить проект

# tmainform.menuitem8.caption
source: Save project
ru: Сохранить проект

source: |Empty package
ru: |Пустой пакет

source: |For all architectures
ru: |Для всех архитектур

# tmainform.releaseedit.hint
source: |Sample: 0.mrx8
ru: |Например: 0.mrx8

source: |Download a list of files by package name
ru: |Загрузить список файлов по имени пакета

# tmainform.savebtn.caption
source: Save project
ru: Сохранить проект

source: |Save project *.prj
ru: |Сохранить проект *.prj

source: |Sign RPM package
ru: |Подписать пакет RPM

source: Basic
ru: Основное

source: Script's
ru: Скрипты

source: HELP
ru: Помощь

source: Unpack
ru: Распаковать

source: |Unpack RPM or DEB package
ru: |Распаковать пакет RPM или DEB

source: |Move record up
ru: |Переместить запись вверх

# tselectform.addbtn.caption
source: Add
ru: Добавить

# tselectform.caption
source: Select files and folders
ru: Выбор файлов и папок

source: |Select file(s) [Ctrl+Mouse]
ru: |Выбор файла(ов) [Ctrl+Мышь]

source: |Select directory
ru: |Выбор директории

# tselectform.updatebtn.caption
source: Update
ru: Обновить

# tunpackform.caption
source: Package unpacker
ru: Распаковщик пакетов

source: Unpack (*.deb or *.rpm):
ru: Распаковать (*.deb или *.rpm):

source: Content upload folder:
ru: Каталог выгрузки содержимого:

# tunpackform.unpackbtn.hint
source: |Start unpacking
ru: |Приступить к распаковке

source: Clearing the working directory...
ru: Очистка рабочей директории...

source: Completed. Press Enter to continue...
ru: Завершено. Для продолжения нажмите Enter...

source: Delete selected items?
ru: Удалить выбранные записи?

source: The list of files is empty!
ru: Список файлов пуст!

source: Please, enter the name of the package:
ru: Пожалуйста, введите имя пакета:

source: No file found ~/.rpmmacros! Not ready to sign packages!
ru: Нет файла ~/.rpmmacros! Не готов подписать пакет!

source: Not enough data for build package!
ru: Не хватает данных для сборки пакета!

source: No list object:
ru: Отсутствует объект списка:

source: Project changed. Save it?
ru: Проект изменялся. Сохранить изменения?

source: Sign the packages:
ru: Подпись пакетов:

source: This is SymLink! Need a real target!
ru: Это SymLink! Нужна настоящая цель!
